{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": "reuters", "name": "Reuters"}, "author": "Yimou Lee", "title": "Taiwan's China-friendly presidential hopeful faces backlash in divided south", "description": "In balmy southern Taiwan, with its rural hamlets, industrial belts and slower-paced cities, a rising tide of residents are pushing back against opposition presidential hopeful Han Kuo-yu, fearing he'll sell out core Taiwan interests to China.", "url": "http://feeds.reuters.com/~r/reuters/topNews/~3/Y-ax-Pi4eQM/taiwans-china-friendly-presidential-hopeful-faces-backlash-in-divided-south-idUSKBN1Z807N", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200109&t=2&i=1474028720&w=1200&r=LYNXMPEG0804C", "publishedAt": "2020-01-09T02:51:28Z", "content": "KAOHSIUNG, Taiwan (Reuters) - In balmy southern Taiwan, with its rural hamlets, industrial belts and slower-paced cities, a rising tide of residents are pushing back against opposition presidential hopeful Han Kuo-yu, fearing he’ll sell out core Taiwan intere… [+4956 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Factbox: How the Iran plane crash ranks among disasters claiming Canadian lives", "description": "A Ukrainian airliner crashed in Iran on Wednesday, killing 63 Canadians. It was one of the biggest, single death tolls involving Canadian citizens in recent times.", "url": "http://feeds.reuters.com/~r/reuters/topNews/~3/TTfwQCwws54/factbox-how-the-iran-plane-crash-ranks-among-disasters-claiming-canadian-lives-idUSKBN1Z72KN", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200109&t=2&i=1474027005&w=1200&r=LYNXMPEG071OE", "publishedAt": "2020-01-09T02:44:13Z", "content": "OTTAWA (Reuters) - A Ukrainian airliner crashed in Iran on Wednesday, killing 63 Canadians. It was one of the biggest, single death tolls involving Canadian citizens in recent times. \r\nFollowing is a list of the most serious disasters than have killed at leas… [+1228 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Colin Packham", "title": "Australia weather bureau sees no sign of cooler weather or rain to quell bushfires", "description": "Australia's weather agency sees no sign of cooler weather or significant rainfall in the next few months, an unwelcome forecast for authorities who have warned that only a large downpour will halt bushfires sweeping across the country.", "url": "http://feeds.reuters.com/~r/reuters/topNews/~3/yZVe7LFzSvo/australia-weather-bureau-sees-no-sign-of-cooler-weather-or-rain-to-quell-bushfires-idUSKBN1Z71UL", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200109&t=2&i=1474025317&w=1200&r=LYNXMPEG0803Q", "publishedAt": "2020-01-09T02:40:33Z", "content": "SYDNEY/MELBOURNE (Reuters) - Australia’s weather agency sees no sign of cooler weather or significant rainfall in the next few months, an unwelcome forecast for authorities who have warned that only a large downpour will halt bushfires sweeping across the cou… [+2366 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Sonali Paul", "title": "Australia issues new evacuation alerts as monster bushfires regenerate", "description": "Authorities issued new warnings and evacuation notices across southeast Australia on Thursday, as a return of hot weather fanned huge bushfires threatening several towns and communities.", "url": "http://feeds.reuters.com/~r/reuters/topNews/~3/G0zp5-Ok7fg/australia-issues-new-evacuation-alerts-as-monster-bushfires-regenerate-idUSKBN1Z730R", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200108&t=2&i=1473963636&w=1200&r=LYNXMPEG07277", "publishedAt": "2020-01-09T02:40:33Z", "content": "MELBOURNE (Reuters) - Authorities issued new warnings and evacuation notices across southeast Australia on Thursday, as a return of hot weather fanned huge bushfires threatening several towns and communities. \r\nA disaster level notice in large parts of Victor… [+4067 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Byron Kaye", "title": "Don't be put off by fires, Australia tells tourists", "description": "Australian Prime Minister Scott Morrison urged foreign tourists not to be deterred by deadly wildfires that have razed large swathes and sent smoke as far as South America, even as authorities fretted about renewed dangers ahead.", "url": "http://feeds.reuters.com/~r/reuters/topNews/~3/DJdK5QcDOTw/dont-be-put-off-by-fires-australia-tells-tourists-idUSKBN1Z62MQ", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200108&t=2&i=1473609669&w=1200&r=LYNXMPEG070C4", "publishedAt": "2020-01-09T02:39:19Z", "content": "SYDNEY (Reuters) - Australian Prime Minister Scott Morrison urged foreign tourists not to be deterred by deadly wildfires that have razed large swathes and sent smoke as far as South America, even as authorities fretted about renewed dangers ahead. \r\nMorrison… [+4261 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Patricia Zengerle", "title": "U.S. congressional study urges sanctions on China over 'crimes against humanity'", "description": "A U.S. congressional report released on Wednesday called for sanctions against China over human rights abuses, and for U.S. officials to keep rights concerns in mind during dealings with Beijing, including trade negotiations.", "url": "http://feeds.reuters.com/~r/reuters/topNews/~3/wCqcbu1mXtI/u-s-congressional-study-urges-sanctions-on-china-over-crimes-against-humanity-idUSKBN1Z71ZM", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200109&t=2&i=1474018948&w=1200&r=LYNXMPEG0803F", "publishedAt": "2020-01-09T02:23:15Z", "content": "WASHINGTON (Reuters) - A U.S. congressional report released on Wednesday called for sanctions against China over human rights abuses, and for U.S. officials to keep rights concerns in mind during dealings with Beijing, including trade negotiations. \r\nThe annu… [+3927 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "U.S. lawmakers predict passage of bill backing China's Uighurs", "description": "Republican and Democratic members of the U.S. Congress predicted on Wednesday that the House of Representatives and Senate would agree on a compromise version of legislation requiring a tougher Trump administration response to China's crackdown on its Uighur …", "url": "http://feeds.reuters.com/~r/reuters/topNews/~3/5pELFgG67vk/u-s-lawmakers-predict-passage-of-bill-backing-chinas-uighurs-idUSKBN1Z7289", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-01-09T02:23:15Z", "content": "WASHINGTON (Reuters) - Republican and Democratic members of the U.S. Congress predicted on Wednesday that the House of Representatives and Senate would agree on a compromise version of legislation requiring a tougher Trump administration response to China’s c… [+624 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Rod Nickel", "title": "Bridal party, academics among Canadian victims of plane crash in Iran", "description": "A newlywed couple that had traveled to Iran to get married were among the 63 Canadians killed when their Ukrainian Airlines flight crashed early on Wednesday, according to friends and community leaders in the western Canadian city where 30 victims came from.", "url": "http://feeds.reuters.com/~r/reuters/topNews/~3/yT1E8jh4xAw/bridal-party-academics-among-canadian-victims-of-plane-crash-in-iran-idUSKBN1Z725E", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20200109&t=2&i=1473999533&w=1200&r=LYNXMPEG0801R", "publishedAt": "2020-01-09T01:19:34Z", "content": "EDMONTON, Alberta (Reuters) - A newlywed couple that had traveled to Iran to get married were among the 63 Canadians killed when their Ukrainian Airlines flight crashed early on Wednesday, according to friends and community leaders in the western Canadian cit… [+3633 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Matthias Williams", "title": "Boeing jet crashes in Iran with no survivors, security sources see technical cause", "description": "A Ukrainian airliner fell to earth in a fireball shortly after take-off from Tehran on Wednesday, killing all 176 people on board in a crash that sparked an international scramble to establish the cause.", "url": "http://feeds.reuters.com/~r/reuters/topNews/~3/k6r8vx04jlQ/boeing-jet-crashes-in-iran-with-no-survivors-security-sources-see-technical-cause-idUSKBN1Z70EL", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20200108&t=2&i=1473685775&w=1200&r=LYNXMPEG070SU", "publishedAt": "2020-01-09T01:09:51Z", "content": "KIEV/WASHINGTON/OTTAWA (Reuters) - A Ukrainian airliner fell to earth in a fireball shortly after take-off from Tehran on Wednesday, killing all 176 people on board in a crash that sparked an international scramble to establish the cause. \r\nThe Ukraine Intern… [+5550 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Patricia Zengerle", "title": "U.S. lawmakers divided over Trump Iran argument, set war powers vote", "description": "Trump administration officials failed to convince Democratic U.S. lawmakers, and some Republicans, on Wednesday that an imminent threat had justified the killing of a top Iranian military commander, and congressional Democrats scheduled a vote on legislation …", "url": "http://feeds.reuters.com/~r/reuters/topNews/~3/UtRB1nYyA9I/u-s-lawmakers-divided-over-trump-iran-argument-set-war-powers-vote-idUSKBN1Z71SM", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200108&t=2&i=1473897213&w=1200&r=LYNXMPEG071W4", "publishedAt": "2020-01-09T00:04:03Z", "content": "WASHINGTON (Reuters) - Trump administration officials failed to convince Democratic U.S. lawmakers, and some Republicans, on Wednesday that an imminent threat had justified the killing of a top Iranian military commander, and congressional Democrats scheduled… [+4291 chars]"}]}